// Составить программу вывода на экран числа, вводимого с клавиатуры. 
//Выводимому числу должно предшествовать сообщение «Вы ввели число».

string chislo;
System.Console.WriteLine("Введите число:");

chislo = Console.ReadLine();

System.Console.WriteLine("Вы ввели число: " + chislo);

